<script setup>

</script>

<template>
  <div>
    <h2>使用须知</h2>
    <p>仅支持提瓦特大陆表层的非沙漠地区，分层地区暂时不支持。</p>

    <h2>使用手册</h2>
    <h3>一、记录|回放|保存</h3>
    <ul>
      <li>开始记录:按下开始记录按钮, 画面闪烁几秒直到相对稳定后，则可以开始插入路径点，快捷键insert或者按下插入预设点按钮</li>
      <li>停止记录:按下停止记录后，可以拖拽画板</li>
      <li>回放：执行当前记录的路径。需要先选择“传送点所在国家”,否则传送时会从蒙德开始移动地图。 点击回放后会自动停止追踪, 需要手动切换到原神窗口且<b>保证小地图出现游戏的左上角</b>, 此时不要操作键盘鼠标 </li>
      <li>保存到服务器:实际上就是上传到<b>_internal/resources/pathlist/xxx</b>目录, xxx名称会根据你输入的名称生成，不可以手动创建目录</li>
      <li>快捷键：按下键盘的<b>Insert</b>插入编辑框的预设信息(开启追踪后，x、y会实时更新), 请注意 <b>第一个点位必须是传送点附近,否则无法传送！</b>, 当路径是空白的时候请走到传送点插入点位</li>
      <li>快捷键：按下键盘的<b>BackSpace</b>删除上一个点位</li>
      <li> 注意事项：如果当前正在编辑文件，即从清单管理页面中点击'编辑'按钮中来到此页面的，则点击'保存到服务器'按钮会写入到该文件，如果需要新建文件则需要刷新页面</li>
    </ul>

    <h3>二、路径信息</h3>
    <ul>
      <li>传送锚点名称：如果传送锚点是副本，请输入该副本的名字, 原因是避免一些其他标记遮挡导致无法直接选择传送按钮</li>
      <li>传送点所在国家：地图切换侧边栏的文字识别需要用到</li>
    </ul>

    <h3>三、点位编辑</h3>
    <ul>
      <li>鼠标移动到画板上的某个点后会弹出编辑框，点击<b>从这里开始回放</b>按钮从指定的位置开始回放，此时会禁用传送(确保人物在该点位附近，否则会判定为异常而停止执行)</li>
      <li>鼠标移动到点位上方会弹出编辑框，编辑完成后按下<b>保存</b>即可保存</li>
      <li>鼠标移动到点位上方弹出的编辑框中，点击<b>插入</b>可以插入新的点位到当前点位的下一个点位</li>
      <li>鼠标移动到点位上方弹出的编辑框中，点击<b>删除</b>可以删除当前点位</li>
      <li>键盘按住Ctrl可以拖动点位</li>
    </ul>

    <h3>四、点位信息介绍</h3>

    <h4>点位类型</h4>
    <ul>
      <li>途径点:路过的点位</li>
      <li>目标点:需要精细接近的点位</li>
    </ul>

    <h4>行走方式</h4>
    <ul>
      <li>普通: 默认的行走策略</li>
      <li>飞行: 从高处往低处行动时，选择飞行模式会自动打开风之翼避免摔死</li>
      <li>跳跃: 不断跳跃, 可以跨越一些小山坡</li>
      <li>游泳: 当目标点在水中时，选择游泳模式会禁用小碎步（小碎步在水中更消耗体力）</li>
      <li>四叶印: 当四叶印在<b>人物前方视角内</b>时，此时按下T可以快速传送到四叶印处，例如树王圣体菇蘑菇平台上的四叶印</li>
    </ul>

    <h4>动作</h4>
    <ul>
      <li>下落攻击：结束飞行的动作，飞行时按下攻击按键</li>
      <li>纳西妲采集：某些采集点无法通过近距离接触时，纳西妲的转圈圈可以采集</li>
      <li>开盾：到达该点位后开启护盾。需要队伍中有护盾角色之一(钟离、莱依拉、迪奥娜、诺艾尔、绮良良)</li>
    </ul>

  </div>
</template>

<style scoped>

</style>