<script setup>

</script>

<template>
  <div>
    <h2>使用手册</h2>
    <h3>记录与回放</h3>
    <p>按下开始追踪，等待画板加载路径，黄圈则是人物所在位置</p>
    <p>传送锚点名称：如果传送锚点是副本，请输入该副本的名字</p>
    <p>快捷键：按下键盘的<b>Insert</b>插入编辑框的预设信息(开启追踪后，x、y会实时更新), 请注意 <b>第一个点位必须是传送点附近,否则无法传送！</b>, 当路径是空白的时候请走到传送点插入点位</p>
    <p>快捷键：按下键盘的<b>BackSpace</b>删除上一个点位</p>
    <p>传送点所在国家：地图切换侧边栏的文字识别需要用到</p>
    <p>点击回放按钮则自动停止追踪, 手动切换到原神窗口且保证小地图出现在左上角, 此时不要操作键盘鼠标，程序会自动回放记录的路径。如需要停止则点击停止按鈕</p>

    <h3>点位编辑</h3>
    <p>鼠标移动到点位上方会弹出编辑框，编辑完成后按下save即可保存</p>
    <p>鼠标移动到点位上方弹出的编辑框中，点击new可以插入新的点位到当前点位的下一个点位</p>
    <p>鼠标移动到点位上方弹出的编辑框中，点击Delete可以删除当前点位</p>
    <p>键盘按住Ctrl可以拖动点位</p>


    <h3>点位信息介绍</h3>
    <p>类型：分为途径点和目标点，所谓目标点就是要采集的对象，此对象会作为统计保存到文件名。途径点就是需要经过的路程</p>
    <p>行走方式</p>
    <li>普通: 默认的行走策略</li>
    <li>飞行: 从高处往低处行动时，选择飞行模式会自动打开风之翼避免摔死</li>
    <li>跳跃: 不断跳跃</li>
    <li>游泳: 当目标点在水中时，选择游泳模式会禁用小碎步（小碎步在水中更消耗体力）</li>
  </div>
</template>

<style scoped>

</style>